#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-deployment/runs/run-imyK2qrF7By6QH7t

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_iam_policy_document.imagebuilder_stage: Refreshing state...
data.aws_availability_zones.available: Refreshing state... [id=us-east-1]
data.aws_vpc.internal_vpc: Refreshing state... [id=vpc-06d6127910664367d]
data.aws_iam_policy_document.imagebuilder_prod: Refreshing state...
aws_s3_bucket.imagebuilder-prod: Refreshing state... [id=imagebuilder-service-prod]
aws_s3_bucket.imagebuilder-stage: Refreshing state... [id=imagebuilder-service-stage]
data.aws_ami.rhel8_x86: Refreshing state... [id=ami-0c82f7789103a1e20]
data.aws_subnet_ids.internal_subnets: Refreshing state... [id=vpc-06d6127910664367d]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-0875d858ff2d5a00c]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.imagebuilder_prod_workers_s3 will be created
  + resource "aws_iam_policy" "imagebuilder_prod_workers_s3" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "imagebuilder-prod-workers-s3"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::imagebuilder-prod/*",
                          + "arn:aws:s3:::imagebuilder-prod",
                        ]
                      + Sid      = "1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_iam_policy.imagebuilder_stage_workers_s3 will be created
  + resource "aws_iam_policy" "imagebuilder_stage_workers_s3" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "imagebuilder-stage-workers-s3"
      + path   = "/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::imagebuilder-stage/*",
                          + "arn:aws:s3:::imagebuilder-stage",
                        ]
                      + Sid      = "1"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket.imagebuilder-prod will be destroyed
  - resource "aws_s3_bucket" "imagebuilder-prod" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::imagebuilder-service-prod" -> null
      - bucket                      = "imagebuilder-service-prod" -> null
      - bucket_domain_name          = "imagebuilder-service-prod.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "imagebuilder-service-prod.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "imagebuilder-service-prod" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "Image Builder S3 bucket for Prod"
          - "ServiceOwner" = "Image Builder"
        } -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.imagebuilder-stage will be destroyed
  - resource "aws_s3_bucket" "imagebuilder-stage" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::imagebuilder-service-stage" -> null
      - bucket                      = "imagebuilder-service-stage" -> null
      - bucket_domain_name          = "imagebuilder-service-stage.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "imagebuilder-service-stage.s3.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "imagebuilder-service-stage" -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "Image Builder S3 bucket for Stage"
          - "ServiceOwner" = "Image Builder"
        } -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.imagebuilder_prod will be created
  + resource "aws_s3_bucket" "imagebuilder_prod" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "imagebuilder-service-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder S3 bucket for Prod"
          + "ServiceOwner" = "Image Builder"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket.imagebuilder_stage will be created
  + resource "aws_s3_bucket" "imagebuilder_stage" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "imagebuilder-service-stage"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "AppCode"      = "IMGB-001"
          + "Name"         = "Image Builder S3 bucket for Stage"
          + "ServiceOwner" = "Image Builder"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```

</details>

*Pusher: @major, Action: `pull_request`*